; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	satellite3 - satellite
	instrument5 - instrument
	satellite4 - satellite
	instrument6 - instrument
	spectrograph4 - mode
	thermograph0 - mode
	thermograph5 - mode
	thermograph2 - mode
	thermograph6 - mode
	spectrograph3 - mode
	infrared1 - mode
	Star0 - direction
	Star1 - direction
	GroundStation3 - direction
	Star4 - direction
	Star5 - direction
	Star2 - direction
	Phenomenon6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Star9 - direction
	Planet10 - direction
	Star11 - direction
	Phenomenon12 - direction
)
(:init
	(supports instrument0 thermograph0)
	(supports instrument0 thermograph6)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star2)
	(calibration_target instrument0 Star5)
	(supports instrument1 thermograph5)
	(supports instrument1 spectrograph3)
	(calibration_target instrument1 Star5)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star4)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star2)
	(supports instrument3 spectrograph4)
	(calibration_target instrument3 Star5)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star4)
	(supports instrument4 thermograph6)
	(calibration_target instrument4 Star4)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star9)
	(supports instrument5 thermograph2)
	(calibration_target instrument5 Star2)
	(on_board instrument5 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star5)
	(supports instrument6 thermograph2)
	(supports instrument6 thermograph6)
	(supports instrument6 infrared1)
	(calibration_target instrument6 Star2)
	(calibration_target instrument6 Star5)
	(on_board instrument6 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Star5)
)
(:goal (and
	(pointing satellite0 Star4)
	(pointing satellite2 Star7)
	(have_image Phenomenon6 thermograph2)
	(have_image Phenomenon6 infrared1)
	(have_image Star7 thermograph6)
	(have_image Phenomenon8 thermograph0)
	(have_image Star9 infrared1)
	(have_image Star9 thermograph5)
	(have_image Planet10 thermograph6)
	(have_image Planet10 thermograph2)
	(have_image Star11 spectrograph3)
	(have_image Phenomenon12 thermograph6)
	(have_image Phenomenon12 thermograph2)
))

)

; plan
1. (switch_on instrument6 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument6)
   goals met: 1 of 13
2. (calibrate satellite4 instrument6 star5)
   added: (calibrated instrument6)
   goals met: 1 of 13
3. (turn_to satellite4 star7 star5)
   deleted: (pointing satellite4 star5)
   added: (pointing satellite4 star7)
   goals met: 1 of 13
4. (take_image satellite4 star7 instrument6 thermograph6)
   added: (have_image star7 thermograph6)
   goals met: 2 of 13
5. (turn_to satellite4 phenomenon12 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 phenomenon12)
   goals met: 2 of 13
6. (turn_to satellite1 star2 star4)
   deleted: (pointing satellite1 star4)
   added: (pointing satellite1 star2)
   goals met: 2 of 13
7. (turn_to satellite0 star5 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 star5)
   goals met: 1 of 13
8. (take_image satellite4 phenomenon12 instrument6 thermograph6)
   added: (have_image phenomenon12 thermograph6)
   goals met: 2 of 13
9. (take_image satellite4 phenomenon12 instrument6 thermograph2)
   added: (have_image phenomenon12 thermograph2)
   goals met: 3 of 13
10. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 3 of 13
11. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 13
12. (calibrate satellite1 instrument2 star2)
   added: (calibrated instrument2)
   goals met: 3 of 13
13. (calibrate satellite0 instrument1 star5)
   added: (calibrated instrument1)
   goals met: 3 of 13
14. (turn_to satellite0 star11 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star11)
   goals met: 3 of 13
15. (take_image satellite0 star11 instrument1 spectrograph3)
   added: (have_image star11 spectrograph3)
   goals met: 4 of 13
16. (turn_to satellite0 star9 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star9)
   goals met: 4 of 13
17. (take_image satellite0 star9 instrument1 thermograph5)
   added: (have_image star9 thermograph5)
   goals met: 5 of 13
18. (turn_to satellite0 star4 star9)
   deleted: (pointing satellite0 star9)
   added: (pointing satellite0 star4)
   goals met: 6 of 13
19. (turn_to satellite1 phenomenon8 star2)
   deleted: (pointing satellite1 star2)
   added: (pointing satellite1 phenomenon8)
   goals met: 6 of 13
20. (take_image satellite1 phenomenon8 instrument2 thermograph0)
   added: (have_image phenomenon8 thermograph0)
   goals met: 7 of 13
21. (turn_to satellite2 star7 star9)
   deleted: (pointing satellite2 star9)
   added: (pointing satellite2 star7)
   goals met: 8 of 13
22. (turn_to satellite4 phenomenon6 phenomenon12)
   deleted: (pointing satellite4 phenomenon12)
   added: (pointing satellite4 phenomenon6)
   goals met: 8 of 13
23. (take_image satellite4 phenomenon6 instrument6 infrared1)
   added: (have_image phenomenon6 infrared1)
   goals met: 9 of 13
24. (take_image satellite4 phenomenon6 instrument6 thermograph2)
   added: (have_image phenomenon6 thermograph2)
   goals met: 10 of 13
25. (turn_to satellite4 planet10 phenomenon6)
   deleted: (pointing satellite4 phenomenon6)
   added: (pointing satellite4 planet10)
   goals met: 10 of 13
26. (take_image satellite4 planet10 instrument6 thermograph2)
   added: (have_image planet10 thermograph2)
   goals met: 11 of 13
27. (take_image satellite4 planet10 instrument6 thermograph6)
   added: (have_image planet10 thermograph6)
   goals met: 12 of 13
28. (turn_to satellite4 star9 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 star9)
   goals met: 12 of 13
29. (take_image satellite4 star9 instrument6 infrared1)
   added: (have_image star9 infrared1)
   goals met: 13 of 13
